
[
  {
    "id": 1,
    "slug": "rera-projects-data-scraper",
    "name": "RERA Projects Data Scraper",
    "tagline": "Automated web scraping tool for real estate compliance data.",
    "overview": "RERA Scraper is a Python-based automation tool designed to collect structured data from the Real Estate Regulatory Authority (RERA) portal. It simplifies the process of retrieving property, agent, and project registration details, making it easier for analysts and researchers to work with real-estate data. The tool eliminates manual data entry by automating data collection, cleaning, and exporting into structured formats.",
    "features": [
      "Automated scraping of property & project details from the RERA portal.",
      "Handles pagination and multiple records efficiently.",
      "Data cleaning and formatting for improved readability.",
      "Robust error handling for missing or restricted data.",
      "Exports data to CSV/Excel for further analysis."
    ],
    "challenges": [
      {
        "challenge": "The RERA portal used dynamic loading and hidden elements.",
        "solution": "Used Selenium waits and advanced DOM traversal to reliably handle dynamic content."
      },
      {
        "challenge": "Large datasets caused performance issues during scraping.",
        "solution": "Implemented pagination handling and batched data exports to optimize memory usage."
      },
      {
        "challenge": "Data fields were inconsistent across different state portals.",
        "solution": "Applied Pandas preprocessing to standardize the output schema for consistent data."
      }
    ],
    "technologies": ["Python", "Selenium", "BeautifulSoup", "Pandas"],
    "skills": ["Web Scraping", "Data Extraction", "Data Cleaning", "Automation", "File Handling"],
    "githubUrl": "https://github.com/kushalmittal04/rera_scraper",
    "liveUrl": null,
    "images": [
      {
        "url": "/images/projects/rera_scraper/screenshot1.png",
        "dataAiHint": "data scraping code"
      }
    ],
    "videoUrl": "https://www.youtube.com/embed/your_video_id_here",
    "category": ["Automation", "Data Scraping"],
    "isFeatured": false
  }
]
